from django.test import TestCase
from django.urls import reverse
from main.converter import convert_dots_to_text


class BrailleToJapanesePageTests(TestCase):
    def test_page_is_displayed(self) -> None:
        response = self.client.get(reverse('main:braille_to_japanese'))

        self.assertEqual(response.status_code, 200)
        self.assertTemplateUsed(response, 'main/braille_to_japanese.html')
        self.assertContains(response, '点字から日本語への変換')

class BrailleToJapaneseConverterTest(TestCase):

    def test_converter_empty_input(self):
        """空のリストが渡された場合のテスト"""
        input_dots = []
        expected_output = ""

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)
        
    def test_converter_basic_katakana(self):
        """基本的なカタカナ変換のテスト"""
        input_dots = [
            [1, 0, 0, 0, 0, 0], [1, 1, 0, 0, 0, 1], [1, 0, 0, 1, 1, 1], [1, 1, 1, 1, 1, 0], [0, 1, 1, 1, 0, 0], # アキステノ
            [1, 0, 1, 0, 0, 1], [1, 1, 1, 0, 1, 1], [0, 0, 1, 1, 0, 0], [0, 0, 1, 1, 0, 1], [0, 0, 1, 1, 1, 0], # ハミヤユヨ
            [1, 0, 0, 0, 1, 0], [0, 0, 1, 0, 0, 0], [0, 0, 1, 0, 1, 0], [0, 0, 1, 0, 1, 1],                     # ラワヲン
        ]
        expected_output = "アキステノハミヤユヨラワヲン"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)
    
    def test_converter_000011(self):
        """⠰（読点や外字符等）の切り替え動作テスト"""
        input_dots = [
            [1, 1, 0, 0, 0, 0], [1, 0, 0, 0, 0, 1], # イカ
            [0, 0, 0, 0, 1, 1], [1, 0, 0, 0, 0, 0], [1, 1, 0, 0, 0, 0], [1, 0, 0, 1, 0, 0], # 外字符abc
            [0, 0, 0, 0, 0, 0], [1, 0, 0, 0, 1, 1], [1, 0, 1, 0, 1, 0], [1, 0, 1, 0, 0, 0], #  サタナ
            [0, 0, 0, 0, 1, 1], [0, 0, 0, 0, 0, 0], [1, 1, 1, 0, 0, 1], [1, 0, 1, 0, 1, 1], # 、　ヒマ
            [0, 0, 0, 0, 1, 1], [1, 1, 1, 1, 0, 1], [0, 0, 0, 0, 1, 1], [0, 1, 0, 1, 0, 1], # ＆＠
            [0, 0, 0, 0, 1, 1], [1, 0, 0, 1, 0, 1], [0, 0, 0, 0, 1, 1], [1, 0, 0, 0, 0, 1], # ＃＊
        ]
        expected_output = "イカabc サタナ、　ヒマ＆＠＃＊"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)
    
    def test_converter_011001(self):
        """⠦⠴（外国語引用符）の動作テスト"""
        input_dots = [
            [1, 0, 0, 1, 0, 0], [1, 0, 0, 1, 0, 1], # ウク
            [0, 1, 1, 0, 0, 1], [1, 0, 0, 1, 1, 0], [1, 0, 0, 0, 1, 0], [0, 0, 1, 0, 1, 1], # 外国語引用始まりde外国語引用符終わり
            [1, 1, 0, 0, 1, 1], [1, 1, 1, 0, 1, 0], # シチ
        ]
        expected_output = "ウクdeシチ"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)
    
    def test_converter_000001(self):
        """⠠（半濁音符、大文字符）の動作テスト"""
        input_dots = [
            [1, 1, 1, 0, 0, 0], [1, 0, 1, 1, 0, 1], # ニフ
            [0, 0, 0, 0, 1, 1], [0, 0, 0, 0, 0, 1], [1, 1, 0, 1, 0, 0], [1, 1, 0, 1, 1, 0], # 外字符大文字符fg
            [0, 0, 0, 0, 0, 0], [1, 0, 1, 1, 1, 1], [1, 1, 0, 1, 0, 0], #  ムエ
            [0, 0, 0, 0, 1, 1], [0, 0, 0, 0, 0, 1], [0, 0, 0, 0, 0, 1], [1, 1, 0, 1, 0, 0], [1, 1, 0, 1, 1, 0], # 外字符大文字符大文字符fg
            [0, 0, 0, 0, 0, 0], [1, 1, 0, 1, 0, 1], [1, 1, 0, 1, 1, 1], # ケセ
            [0, 1, 1, 0, 0, 1], [0, 0, 0, 0, 0, 1], [1, 1, 0, 0, 1, 0], [0, 1, 0, 1, 0, 0], [0, 0, 1, 0, 1, 1], # 外国語引用符始まり大文字符hi外国語引用符終わり
            [1, 0, 1, 1, 1, 0], [1, 0, 1, 1, 0, 0], # ツヌ
            [0, 1, 1, 0, 0, 1], [0, 0, 0, 0, 0, 1], [0, 0, 0, 0, 0, 1], [1, 1, 0, 0, 1, 0], [0, 1, 0, 1, 0, 0], [0, 0, 1, 0, 1, 1], # 外国語引用符始まり大文字符大文字符hi外国語引用符終わり
            [0, 0, 0, 0, 0, 1], [1, 0, 1, 0, 0, 1], [0, 0, 0 ,0 ,0 , 1], [1, 1, 1, 0, 0, 1], [0, 0, 0, 0, 0, 1], [1, 0, 1, 1, 0, 1], # パピプ
            [0, 0, 0 ,0 ,0 , 1], [1, 1, 1, 1, 0, 1], [0, 0, 0, 0, 0, 1], [0, 1, 1, 1, 0, 1], # ペポ
        ]
        expected_output = "ニフFg ムエFG ケセHiツヌHIパピプペポ"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)

    def test_converter_010001(self):
        """⠢（疑問符等）の動作テスト"""
        input_dots = [
            [0, 1, 0, 1, 0, 0], [0, 1, 0, 0, 0, 1], [0, 0, 0, 0, 0, 0], # オ？　
            [0, 1, 0, 0, 0, 1], [1, 0, 0, 0, 0, 1], [0, 1, 0, 0, 0, 1], [1, 1, 0, 0, 0, 1], # クァクィ
            [0, 1, 0, 0, 0, 1], [1, 1, 0, 1, 0, 1], [0, 1, 0, 0, 0, 1], [0, 1, 0, 1, 0, 1], # クェクォ
            [0, 1, 0, 0, 0, 1], [1, 0, 1, 1, 1, 0], # トゥ
        ]
        expected_output = "オ？　クァクィクェクォトゥ"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)

    def test_converter_010011(self):
        """⠲（句点等）の動作テスト"""
        input_dots = [
            [0, 1, 0, 1, 0, 1], [0, 1, 0, 0, 1, 1], [0, 0, 0, 0, 0, 0], # コ。　
            [0, 1, 0, 0, 1, 1], [1, 0, 0, 0, 0, 1], [0, 1, 0, 0, 1, 1], [1, 1, 0, 0, 0, 1], # グァグィ
            [0, 1, 0, 0, 1, 1], [1, 1, 0, 1, 0, 1], [0, 1, 0, 0, 1, 1], [0, 1, 0, 1, 0, 1], # グェグォ
            [0, 1, 0, 0, 1, 1], [1, 0, 1, 0, 0, 1], [0, 1, 0, 0, 1, 1], [1, 1, 1, 0, 0, 1], # ヴァヴィ
            [0, 1, 0, 0, 1, 1], [1, 1, 1, 1, 0, 1], [0, 1, 0, 0, 1, 1], [0, 1, 1, 1, 0, 1], # ヴェヴォ
            [0, 1, 0, 0, 1, 1], [1, 0, 1, 1, 1, 0], # ドゥ
        ]
        expected_output = "コ。　グァグィグェグォヴァヴィヴェヴォドゥ"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)
    
    def test_converter_symbol(self):
        """記号（長音、第一つなぎ符、第1カッコ）の変換テスト"""
        input_dots = [
            [0, 1, 0, 1, 1, 1], [0, 1, 0, 0, 1, 0], [0, 1, 1, 1, 1, 0], # ソート 
            [1, 1, 1, 1, 0, 0], [0, 0, 1, 0, 0, 1], [0, 1, 1, 1, 0, 1], # ネ-ホ 
            [0, 0, 0, 0, 1, 1], [1, 1, 1, 0, 0, 0], [0, 0, 1, 0, 0, 1], [1, 0, 1, 1, 0, 0], [0, 0, 0, 0, 0, 0], # l-m 
            [0, 1, 1, 1, 1, 1], [0, 1, 1, 0, 1, 1], [1, 1, 0, 0, 1, 0], [0, 1, 1, 0, 1, 1], # モ（リ）
            [0, 0, 0, 0, 1, 1], [0, 1, 0, 1, 1, 0], [0, 1, 1, 0, 1, 1], [1, 0, 1, 0, 0, 0], [0, 1, 1, 0, 1, 1], # j(k)
        ]
        expected_output = "ソートネ-ホl-m モ（リ）j(k)"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)

    def test_converter_000100(self):
        """っを含む拗音(符)の変換テスト"""
        input_dots = [
            [1, 0, 0, 1, 1, 0], [0, 1, 0, 0, 0, 0], [1, 1, 0, 1, 1, 0], # ルッレ 
            [0, 0, 0, 1, 0, 0], [1, 1, 0, 0, 1, 1], #スィ 
            [0, 0, 0, 1, 0, 0], [1, 1, 1, 0, 1, 0], #ティ 
            [0, 0, 0, 1, 0, 0], [1, 1, 0, 1, 0, 1], #キェ 
            [0, 0, 0, 1, 0, 0], [1, 0, 0, 0, 0, 1], [0, 0, 0, 1, 0, 0], [1, 0, 0, 1, 0, 1], [0, 0, 0, 1, 0, 0], [0, 1, 0, 1, 0, 1], # キャキュキョ 
            [0, 0, 0, 1, 1, 0], [1, 0, 0, 0, 1, 1], [0, 0, 0, 1, 1, 0], [1, 0, 0, 1, 1, 1], [0, 0, 0, 1, 1, 0], [0, 1, 0, 1, 1, 1], # ジャジュジョ
            [0, 0, 0, 1, 0, 1], [1, 0, 1, 0, 0, 1], [0, 0, 0, 1, 0, 1], [1, 0, 1, 1, 0, 1], [0, 0, 0, 1, 0, 1], [0, 1, 1, 1, 0, 1], # ピャピュピョ 
            [0, 0, 0, 1, 0, 1], [1, 0, 1, 1, 1, 0], [0, 0, 0, 1, 0, 1], [0, 0, 1, 1, 0, 1], [0, 0, 0, 1, 0, 1], [0, 0, 1, 1, 1, 0], # テュフュフョ
        ]
        expected_output = "ルッレスィティキェキャキュキョジャジュジョピャピュピョテュフュフョ"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)
    
    def test_converter_000010(self):
        """⠐（濁点符）の変換テスト"""
        input_dots = [
            [0, 1, 0, 1, 1, 0], [0, 0, 0, 0, 1, 0], [0, 0, 0, 0, 0, 0], # ロ・　
            [0, 0, 0, 0, 1, 0], [1, 0, 0, 0, 0, 1], [0, 0, 0, 0, 1, 0], [1, 1, 0, 0, 0, 1], # ガギ
            [0, 0, 0, 0, 1, 0], [1, 0, 0, 1, 0, 1], [0, 0, 0, 0, 1, 0], [1, 1, 0, 1, 0, 1], # グゲ
            [0, 0, 0, 0, 1, 0], [0, 1, 0, 1, 0, 1], [0, 0, 0, 0, 1, 0], [1, 0, 0, 1, 0, 0], # ゴヴ
            [0, 0, 0, 0, 1, 0], [1, 0, 1, 0, 1, 1], [0, 0, 0, 0, 1, 0], [1, 1, 1, 0, 1, 1], # 〇△
            [0, 0, 0, 0, 1, 0], [1, 0, 1, 1, 1, 1], [0, 0, 0, 0, 1, 0], [1, 1, 1, 1, 1, 1], # □×
        ]
        expected_output = "ロ・　ガギグゲゴヴ〇△□×"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)
    
    def test_converter_tokushu(self):
        """特殊音の変換テスト"""
        input_dots = [
            [0, 0, 0, 1, 1, 1], [1, 0, 1, 1, 1, 0], [0, 0, 0, 1, 1, 1], [0, 0, 1, 1, 0, 1], [0, 0, 0, 1, 1, 1], [0, 0, 1, 1, 1, 0], # デュヴュヴョ
        ]
        expected_output = "デュヴュヴョ"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)
    
    def test_converter_numbers(self):
        """数値変換と数字から日本語や英語への切り替え動作テスト"""
        input_dots = [
            [0, 0, 1, 1, 1, 1], [1, 0, 0, 0, 0, 0], [0, 0, 1, 0, 0, 0], [1, 0, 0, 1, 1, 0], [0, 1, 0, 0, 0, 0], [1, 1, 0, 1, 1, 0], 
            [0, 0, 0, 0, 0, 0], [0, 1, 0, 1, 0, 0], [0, 1, 0, 1, 1, 0], 
            [0, 0, 0, 0, 0, 0], [0, 0, 1, 1, 1, 1], [1, 1, 0, 0, 0, 0], 
            [0, 0, 0, 0, 1, 1], [1, 0, 0, 1, 0, 0], 
            [0, 0, 1, 1, 1, 1], [1, 0, 0, 1, 0, 0],
        ]
        expected_output = "1,4.7　オロ　2c3"

        result = convert_dots_to_text(input_dots)
        self.assertEqual(result, expected_output)